kinton/nrf52_expirements/ble_app_uart/main.c
        // SAVING INTO MEMORY
        // endabled: FDS_ENABLED, NRF_FSTORAGE_ENABLED
        // FDS_SUCCESS => NRF_SUCCESS
        // FDS_OP_QUEUE_SIZE 4 => 16
        #define FILE_ID     0x1111
        #define REC_KEY     0x2222

        // static char const my_text[]    = "What a day, what a day!";
        static char my_text[10];
        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            my_text[i] = p_evt->params.rx_data.p_data[i];
        }

        fds_record_t        record;
        fds_find_token_t  token  = {0};
        fds_record_desc_t   record_desc = {0};
        //fds_record_chunk_t  record_chunk; // old api

        if (fds_record_find(FILE_ID, REC_KEY, &record_desc, &token) == NRF_SUCCESS) {

          // Set up data.
          record.data.p_data         =  my_text; 
          record.data.length_words   =  (sizeof(my_text)+3)/4;  // When calculating the length in words, using integer division, the result will always be "rounded" down to the whole integer. A data array of 21 bytes, is strictly speaking 5 words + 1 byte. However, the length should be in words, and thus 6 words are needed to store all the data. 21/4 = 5, (21+3)/4 = 6. For 20 bytes, 5 words are needed, in integer division 20/4 = (20+3)/4 =5.
          // or sizeof(m_deadbeef)/sizeof(uint8_t);? (sizeof(my_text)+3)/4
          // Set up record.
          record.file_id             = FILE_ID;
          record.key                 = REC_KEY;
          // record.data.p_chunks        = &record_chunk; // old api
          // record.data.num_chunks      = 1; // old api

          ret_code_t ret = fds_record_update(&record_desc, &record);
          if (ret != NRF_SUCCESS) 
          {
                  // return ret;
                  NRF_LOG_INFO("Error (write)");
          }
          NRF_LOG_INFO("Updating Record ID = %d \r\n",record_desc.record_id);
          // return NRF_SUCCESS;
        } else {
          // Set up data.
          record.data.p_data         =  my_text; 
          record.data.length_words   =  (sizeof(my_text)+3)/4;  // When calculating the length in words, using integer division, the result will always be "rounded" down to the whole integer. A data array of 21 bytes, is strictly speaking 5 words + 1 byte. However, the length should be in words, and thus 6 words are needed to store all the data. 21/4 = 5, (21+3)/4 = 6. For 20 bytes, 5 words are needed, in integer division 20/4 = (20+3)/4 =5.
          // or sizeof(m_deadbeef)/sizeof(uint8_t);? (sizeof(my_text)+3)/4
          // Set up record.
          record.file_id             = FILE_ID;
          record.key                 = REC_KEY;
          // record.data.p_chunks        = &record_chunk; // old api
          // record.data.num_chunks      = 1; // old api

          ret_code_t ret = fds_record_write(&record_desc, &record);
          if (ret != NRF_SUCCESS) 
          {
                  // return ret;
                  NRF_LOG_INFO("Error (write 2)");
          }
          NRF_LOG_INFO("Writing Record ID = %d \r\n",record_desc.record_id);
        }

        // fds_flash_record_t  flash_record;
        // fds_record_desc_t   record_desc;
        // fds_find_token_t    ftok ={0};//Important, make sure you zero init the ftok token
        // uint8_t *data;

        // NRF_LOG_INFO("Start searching... \r\n");
        // // Loop until all records with the given key and file ID have been found.
        // while (fds_record_find(read_file_id, relevant_record_key, &record_desc, &ftok) == FDS_SUCCESS)
        // {
        //     err_code = fds_record_open(&record_desc, &flash_record);
        //     if ( err_code != FDS_SUCCESS)
        //     {
        //         return err_code;		
        //     }
            
        //     NRF_LOG_INFO("Found Record ID = %d\r\n",record_desc.record_id);

        //     data = (uint8_t *) flash_record.p_data;
        //     for (uint8_t i=0;i<flash_record.p_header->length_words;i++)
        //     {
        //         read_data[i] = data[i];
        //     }
        

        //     NRF_LOG_HEXDUMP_INFO(read_data, sizeof(read_data));
        //     // Access the record through the flash_record structure.
        //     // Close the record when done.
        //     err_code = fds_record_close(&record_desc);
        //     if (err_code != FDS_SUCCESS)
        //     {
        //         // return err_code;
        //         NRF_LOG_INFO("Error");
        //     }
        // }
        if (false) {
        fds_record_desc_t desc = {0};
        fds_find_token_t  tok  = {0};
        fds_flash_record_t  flash_record;
        char     *p_data;
        #define CONFIG_FILE     0x1111
        #define CONFIG_REC_KEY  0x2222
        bool flag = false;
        while(fds_record_find(CONFIG_FILE, CONFIG_REC_KEY, &desc, &tok) == NRF_SUCCESS) {
            NRF_LOG_INFO("success!!!!!!!!!");

            err_code = fds_record_open(&desc, &flash_record);
            if ( err_code != NRF_SUCCESS)
            {
                // return err_code;
                NRF_LOG_INFO("Error (read)");
            }

            NRF_LOG_INFO("Found Record ID = %d\r\n",desc.record_id);
            NRF_LOG_INFO("Data = ");
            
            // Access the record through the flash_record structure.
            p_data = (char *) flash_record.p_data;
            NRF_LOG_INFO(" %s \r\n", (uint32_t)p_data);
        
            
            // Close the record when done.
            err_code = fds_record_close(&desc);
            if (err_code != NRF_SUCCESS)
            {
                // return err_code;
                NRF_LOG_INFO("Error (read 2 )");
            }

            flag = true;
        }

        // uint16_t length = sizeof(p_data);
        uint16_t length = sizeof(p_data) * 4;
        /* uint8_t data_array[length];
        for (uint32_t i = 0; i < length; i++)
        {
            data_array[i] = p_data[i];
        }*/
        // uint8_t data_array[15] = {'1', '2'};
        // uint16_t length = 15;
        if (flag) {
          err_code = ble_nus_data_send(&m_nus, p_data, &length, m_conn_handle);
          APP_ERROR_CHECK(err_code);
        } else {
          NRF_LOG_INFO("can't find any");
        }
        }

        // READING FROM MEMORY
        // #define FILE_ID     0x1111
        // #define REC_KEY     0x2222
        // fds_flash_record_t  flash_record;
        // fds_record_desc_t   record_desc_read = {0};
        // fds_find_token_t    ftok ={0};//Important, make sure you zero init the ftok token
        
        // char     *p_data;
        
